src/toir_cfe/src/Documents/торо_ВозвратТоваровНаСклад/торо_ВозвратТоваровНаСклад.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="20295b06-b6bf-45bf-a8bb-32f29e6334d0">
  <name>торо_ВозвратТоваровНаСклад</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Document>

src/toir_cfe/src/AccumulationRegisters/проф_ТоварыНаСкладах/проф_ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3f2b5e01-847b-49d9-b668-ee6122445039">
  <name>проф_ТоварыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="78a7323c-7389-4599-84d6-fde6c3c3533d">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="9c39d63c-41cb-4486-a9ee-180052b85921">
    <name>КонтролироватьОстатки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="8289f7d9-fa0a-45f7-be0c-238495f87a84">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="8df19511-0c7e-41a8-90eb-f953e351a534">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="bd312888-71b8-45b3-bbf7-970c05bc2727">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="951359e6-820e-4f61-a602-16a239f40091">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="328ce0e5-8d0f-4315-8e53-033acc81fdd0">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

src/toir_cfe/src/Documents/торо_ВозвратТоваровНаСклад/ObjectModule.bsl
#Область ОбработчикиСобытий
	
&После("ОбработкаПроведения")
Процедура проф_ОбработкаПроведения(Отказ, РежимПроведения)
	
	//++ Проф-ИТ, #27, Соловьев А.А., 25.08.2023
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;	
	
	ФОИспользоватьСерии = Константы.ИспользоватьСерииНоменклатуры.Получить();
	ФОИспользоватьХарактеристики = Константы.торо_ИспользоватьХарактеристикиНоменклатуры.Получить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	торо_ВозвратТоваровНаСклад.Дата КАК Период,
	|	торо_ВозвратТоваровНаСклад.ЗаказНаВнутреннееПотребление КАК ЗаказНаВнутреннееПотребление,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТабличнаяЧасть.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ФОИспользоватьХарактеристики
	|			ТОГДА ТабличнаяЧасть.Характеристика 
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Характеристика,
	|	ВЫБОР
	|		КОГДА &ФОИспользоватьСерии
	|			ТОГДА ТабличнаяЧасть.Серия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Серия,
	|	ТабличнаяЧасть.Склад КАК Склад,
	|	ТабличнаяЧасть.проф_Назначение КАК Назначение,
	|	СУММА(ТабличнаяЧасть.Количество) КАК Количество
	|ИЗ 
	|	Документ.торо_ВозвратТоваровНаСклад КАК торо_ВозвратТоваровНаСклад
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ВозвратТоваровНаСклад.Товары КАК ТабличнаяЧасть 
	|		ПО торо_ВозвратТоваровНаСклад.Ссылка = ТабличнаяЧасть.Ссылка
	|ГДЕ
	|	торо_ВозвратТоваровНаСклад.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	торо_ВозвратТоваровНаСклад.Дата,
	|	торо_ВозвратТоваровНаСклад.ЗаказНаВнутреннееПотребление,
	|	ТабличнаяЧасть.Номенклатура,
	|	ТабличнаяЧасть.Характеристика,
	|	ТабличнаяЧасть.Серия,
	|	ТабличнаяЧасть.Склад,
	|	ТабличнаяЧасть.проф_Назначение";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ФОИспользоватьХарактеристики", ФОИспользоватьХарактеристики);
	Запрос.УстановитьПараметр("ФОИспользоватьСерии", ФОИспользоватьСерии);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат;
	КонецЕсли;	

	Движения.проф_ТоварыНаСкладах.Записывать = Истина;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Движение = Движения.проф_ТоварыНаСкладах.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Выборка);
	КонецЦикла;
	//-- Проф-ИТ, #27, Соловьев А.А., 25.08.2023
	
КонецПроцедуры

#КонецОбласти
